{
    "DasWetter.com_adapter_settings": "Configuración del adaptador DasWetter.com",
    "Icon set": "Conjunto de iconos",
    "Icon set to select": "Conjunto de iconos para seleccionar",
    "Icons": "Iconos",
    "JSON file with 5-day weather forecast and detailed information for every 3 hours": "Archivo JSON con previsión meteorológica de 5 días e información detallada cada 3 horas.",
    "MoonIcons": "Iconos de luna",
    "URL_5_days_forecast": "ruta 2: archivo XML con pronóstico del tiempo para 5 días e información detallada por cada 3 horas",
    "URL_7_days_forecast": "ruta 1: archivo XML con pronóstico del tiempo para 7 días y descripción general del día",
    "URL_hourly_forecast": "ruta 3: archivo XML con pronóstico del tiempo para los próximos 5 días e información por hora",
    "URL_hourly_forecast_JSON": "ruta 4: archivo JSON con pronóstico del tiempo para los próximos 5 días e información por hora",
    "WindIcons": "Iconos de viento",
    "XML file with 5-day weather forecast and detailed information for every 3 hours": "Archivo XML con previsión meteorológica de 5 días e información detallada cada 3 horas.",
    "XML file with the 7-day weather forecast and general daily overview": "Archivo XML con la previsión meteorológica de 7 días y una descripción general diaria",
    "XML file with weather forecasts for the next 5 days and hourly information": "Archivo XML con previsiones meteorológicas para los próximos 5 días e información horaria.",
    "createCurrent": "crear copia para la hora actual",
    "createInXHour": "crear copia por hora",
    "custom_path": "camino personalizado",
    "custom_path_ext": "extensión de nombre de archivo personalizada",
    "custom_path_hint": "la ruta personalizada debe estar en la forma \"/ adapter / daswetter / icons / tiempo-weather / galeria4 /\". La extensión debe comenzar con un punto (por ejemplo, .png)",
    "custum": "costumbre",
    "hint_path": "En general, basta con especificar una sola ruta. Compruebe si realmente necesita todas las rutas para su aplicación específica.",
    "in 1 hour": "en 1 hora",
    "in 2 hour": "en 2 horas",
    "in 3 hour": "en 3 horas",
    "in 6 hour": "en 6 horas",
    "none": "ninguno",
    "original": "original",
    "parse_timeout": "descargar y analizar el tiempo de espera [segundos]",
    "path configuration": "configuración de ruta",
    "settings": "ajustes",
    "use_color_or_bw": "utilizar símbolos de colores o blancos",
    "use_only_the_URL_you_need": "Use solo la URL que necesita, deje los otros en blanco. Use minutos arbitrarios en la configuración de cron porque el servidor API responde tarde en horas exactas, medias horas, etc. (problema de sobrecarga del servidor).",
    "use_png_or_svg": "usa PNG en lugar de SVG"
}
