{
  "common": {
    "name": "daswetter",
    "version": "4.5.0",
    "news": {
      "4.5.0": {
        "en": "show symbol description beside the symbol in admin as preview\nsee issue #480: set minimum interval for data request to 60 minutes to avoid too many requests\nnew icons (png only) added (thanks to forum member Negalein)\nsee issue #478. bug fix copy current data at midnight\nsee issue #492: rate limiter: check expired time of last request before new request\nsee issue #490: icon file extension selectable in admin (svg, png or gif)",
        "de": "symbolbeschreibung neben dem symbol in admin als vorschau anzeigen\nsiehe ausgabe #480: mindestintervall für die datenanfrage auf 60 minuten festlegen, um zu viele anfragen zu vermeiden\nneue Icons (nur Png) hinzugefügt (dank Forummitglied Negalein)\nsiehe ausgabe #478. fehler beheben kopieren sie aktuelle daten um mitternacht\nsiehe ausgabe #492: preisbegrenzer: abgelaufene zeit der letzten anfrage vor neuer anfrage\nsiehe ausgabe #490: symbol-dateierweiterung wählbar in admin (svg, png oder gif)",
        "ru": "показать описание символа рядом с символом в admin в качестве предварительного просмотра\nпроблема no480: установить минимальный интервал для запроса данных до 60 минут, чтобы избежать слишком большого количества запросов\nдобавлены новые значки (только png) (благодарим участника форума Негалейна)\nсм. статью #478. исправление ошибок копировать текущие данные в полночь\n#492: ограничитель скорости: проверьте истекшее время последнего запроса перед новым запросом\nпроблема #490: расширение файла иконки, выбираемое в админ (svg, png или gif)",
        "pt": "mostrar a descrição do símbolo ao lado do símbolo no administrador como antevisão\nver problema #480: definir intervalo mínimo para a solicitação de dados para 60 minutos para evitar muitos pedidos\nnovos ícones (apenas png) adicionados (graças ao membro do fórum Negalein)\nver número 478. corrigir erro copiar dados atuais à meia-noite\nver problema #492: limitador de taxa: verificação expirada do último pedido antes de novo pedido\nver problema #490: extensão de arquivo ícone selecionável no administrador (svg, png ou gif)",
        "nl": "toon symbool beschrijving naast het symbool in admin als voorbeeld\nzie probleem #480: stel een minimum interval in voor gegevensverzoek tot 60 minuten om te veel verzoeken te vermijden\nnieuwe pictogrammen (alleen png) toegevoegd (met dank aan forumlid Negalein)\nzie nummer 478. fout repareren kopieer huidige gegevens om middernacht\nzie nummer #492: snelheid limiter: controleer verlopen tijd van laatste verzoek voor nieuw verzoek\nzie probleem #490: pictogram bestandsextensie te selecteren in admin (svg, png of gif)",
        "fr": "afficher la description du symbole à côté du symbole dans admin comme aperçu\nvoir le numéro 480: fixer l'intervalle minimal pour la demande de données à 60 minutes pour éviter trop de demandes\nnouvelles icônes (png seulement) ajoutées (merci au membre du forum Negalein)\nvoir numéro 478. bug corriger copie les données actuelles à minuit\nvoir le numéro #492: limiteur de tarifs: vérifier l'expiration de la dernière demande avant la nouvelle demande\nvoir le numéro #490: extension de fichier icône sélectionnable dans admin (svg, png ou gif)",
        "it": "mostra la descrizione del simbolo accanto al simbolo in admin come anteprima\nvedi numero #480: impostare l'intervallo minimo per la richiesta di dati a 60 minuti per evitare troppe richieste\nnuove icone (solo png) aggiunto (grazie al membro del forum Negalein)\nvedi numero 478. correzione bug copia dati correnti a mezzanotte\nvedi numero #492: tasso limiter: check scaduto tempo di ultima richiesta prima della nuova richiesta\nvedi numero #490: estensione del file icon selezionabile in admin (svg, png o gif)",
        "es": "mostrar la descripción del símbolo junto al símbolo en admin como vista previa\nver número #480: establecer intervalo mínimo para la solicitud de datos a 60 minutos para evitar demasiadas solicitudes\nnuevos iconos (png solamente) añadido (gracias al miembro del foro Negalein)\nver número #478. corrección de errores copia datos actuales a medianoche\nver número #492: límite de tarifas: comprobar el tiempo expirado de la última solicitud antes de la nueva solicitud\nver número #490: extensión de archivo icono seleccionable en admin (svg, png o gif)",
        "pl": "pokaż opis symbolu obok symbolu w admin jako podgląd\nzobacz numer # 480: ustawić minimalny odstęp dla żądania danych do 60 minut, aby uniknąć zbyt wielu żądań\ndodano nowe ikony (tylko png) (dzięki członkowi forum Negalein)\nzob. numer 478. błąd naprawić kopiowanie danych bieżących o północy\npatrz numer # 492: ograniczenie stawki: sprawdzenie upłynął czas ostatniego wniosku przed nowym wnioskiem\nzobacz wydanie # 490: rozszerzenie pliku ikon wybrane w admin (svg, png lub gif)",
        "uk": "показати символ опису біля символу в адміні як попередній перегляд\nпереглянути номер #480: встановити мінімальний інтервал для запиту даних до 60 хвилин, щоб уникнути занадто багато запитів\nдодано нові ікони (тільки png)\nпереглянути номер #478. виправлення помилок на ніч\nпереглянути проблему #492: обмеження швидкості: перевірити час останнього запиту перед новим запитом\nпереглянути проблему #490: розширення файлу іконки, вибране в адмінці (, png або gif)",
        "zh-cn": "在管理员符号旁显示符号描述作为预览\n参见问题480:将数据请求的最小间隔设定为60分钟,以避免请求过多\n添加新图标( 仅 png) (感谢论坛成员 Negalein)\n见问题478。 午夜时段错误修正当前数据\n参见问题# 492: 速率限制器: 在新请求前检查上次请求的过期时间\n参见问题 # 490: 图标文件扩展名可选择在管理员( svg, png 或 gif) 中"
      },
      "4.4.1": {
        "en": "*Attention:** The folder structure for the icons has changed. A few icon sets are already available, but others are still missing. If anyone would like to contribute their icons, please contact me.\nnew folder structure for weather, wind and moon icons",
        "de": "*Attention:** Die Ordnerstruktur für die Icons hat sich geändert. Einige Icon-Sets sind bereits vorhanden, andere fehlen aber noch. Wenn jemand ihre Icons beibringen möchte, kontaktieren Sie mich bitte.\nneue ordnerstruktur für wetter-, wind- und mondsymbole",
        "ru": "*Внимание:** Структура папок для иконок изменилась. Несколько наборов значков уже доступны, но другие все еще отсутствуют. Если кто-то хочет поделиться своими иконами, пожалуйста, свяжитесь со мной.\nновая структура папок для икон погоды, ветра и луны",
        "pt": "*Atenção:**A estrutura da pasta para os ícones mudou. Alguns conjuntos de ícones já estão disponíveis, mas outros ainda estão faltando. Se alguém quiser contribuir com seus ícones, entre em contato comigo.\nnova estrutura de pasta para ícones de tempo, vento e lua",
        "nl": "*Let op:** De mapstructuur voor de pictogrammen is veranderd. Een paar pictogramsets zijn al beschikbaar, maar anderen ontbreken nog. Als iemand zijn iconen wil bijdragen, neem dan contact met me op.\nnieuwe mapstructuur voor weer, wind en maanpictogrammen",
        "fr": "*Attention :** La structure du dossier pour les icônes a changé. Quelques jeux d'icônes sont déjà disponibles, mais d'autres manquent encore. Si quelqu'un souhaite contribuer à leurs icônes, veuillez me contacter.\nnouvelle structure de dossier pour les icônes météo, vent et lune",
        "it": "*Attenzione:** La struttura della cartella per le icone è cambiata. Alcuni set icona sono già disponibili, ma altri sono ancora mancanti. Se qualcuno vuole contribuire alle proprie icone, contattatemi.\nnuova struttura della cartella per le icone meteo, vento e luna",
        "es": "*Atención:** La estructura de carpetas para los iconos ha cambiado. Algunos iconos ya están disponibles, pero otros siguen desaparecidos. Si alguien quiere aportar sus iconos, por favor contácteme.\nnueva estructura de carpetas para iconos meteorológicos, vientos y lunas",
        "pl": "* Uwaga: * * Struktura folderów dla ikon uległa zmianie. Kilka zestawów ikon jest już dostępnych, ale innych nadal brakuje. Jeśli ktoś chciałby wnieść swoje ikony, skontaktuj się ze mną.\nnowa struktura folderów dla ikon pogody, wiatru i księżyca",
        "uk": "*Примітка:*** Змінено структуру папки для ікон. Кілька іконок вже доступні, але інші все ще відсутні. Якщо хтось хотів би допомогти своїм іконам, будь ласка, зв'яжіться з нами.\nнова структура папок для погодних умов, вітрових і місячних ікон",
        "zh-cn": "*注意:** 图标的文件夹结构已经改变。 已有一些图标集可供使用,但其他的仍然缺失. 如果有人愿意献上他们的偶像,请联系我.\n用于天气、风和月亮图标的新文件夹结构"
      },
      "4.3.0": {
        "en": "41 icons for DasWetter@4.x (galeria7)",
        "de": "41 Symbole für DasWetter@4.x (galeria7)",
        "ru": "41 значок для DasWetter@4.x (галерея7)",
        "pt": "41 ícones para DasWitter@ 4. x (galeria7)",
        "nl": "41 iconen voor DasWetter@4.x (galeria7)",
        "fr": "41 icônes pour DasWetter@4.x (galeria7)",
        "it": "41 icone per DasWetter@4.x (galeria7)",
        "es": "41 iconos para DasWetter@4.x (galeria7)",
        "pl": "41 ikon dla DasWetter @ 4.x (galeria7)",
        "uk": "41 іконки для DasWetter@4.x (галерія7)",
        "zh-cn": "41 个 DasWetter@ 4.x (galeria7) 的图标"
      },
      "4.2.0": {
        "en": "translations of symbol descriptions\nsome new datapoints (time and date) to identify forecast periods\nsee issue #462: sun and moon times now without date part (time-only)\nAdd bundesland / state as search option and move some debug to info logs",
        "de": "übersetzungen von symbolbeschreibungen\neinige neue datenpunkte (zeit und datum) zur identifizierung von prognosezeiten\nsiehe ausgabe #462: sonnen- und mondzeiten jetzt ohne datumsteil (nur)\nFügen Sie Bungalow / Zustand als Suchoption und verschieben Sie einige Debug zu Info-Logs",
        "ru": "перевод описания символов\nнекоторые новые точки данных (время и дата) для определения прогнозных периодов\n#462: время солнца и луны теперь без даты (только по времени)\nДобавьте bundesland / state в качестве опции поиска и переместите некоторые отладки в информационные журналы",
        "pt": "traduções de descrições de símbolos\nalguns novos pontos de dados (hora e data) para identificar os períodos de previsão\nver o número 462: horas do sol e da lua agora sem parte da data (somente no tempo)\nAdicionar bundesland / estado como opção de pesquisa e mover alguns debug para logs de informações",
        "nl": "vertalingen van symbolenbeschrijvingen\neen aantal nieuwe datapunten (tijd en datum) om prognoses te bepalen\nzie nummer #462: zon en maan tijden nu zonder datum deel (alleen tijd)\nVoeg bundesland / status als zoekoptie toe en verplaats wat debug naar info logs",
        "fr": "traduction des descriptions des symboles\nde nouveaux points de données (heure et date) pour identifier les périodes de prévision\nvoir numéro #462: heures de soleil et de lune maintenant sans date partie (temps seulement)\nAjouter bundesland / état comme option de recherche et déplacer un debug dans les journaux d'info",
        "it": "traduzioni delle descrizioni dei simboli\nalcuni nuovi datapoint (ora e data) per identificare i periodi di previsione\nvedi numero #462: sole e luna ora senza data parte (solo orario)\nAggiungi bundesland / stato come opzione di ricerca e spostare un po 'di debug ai registri di informazioni",
        "es": "traducciones de descripciones de símbolos\nalgunos nuevos puntos de datos (tiempo y fecha) para determinar los períodos de pronóstico\nver número #462: sol y luna tiempos ahora sin la parte de la fecha (solamente)\nAñadir bundesland / estado como opción de búsqueda y mover un poco de depuración a los registros de información",
        "pl": "tłumaczenia opisów symboli\nniektóre nowe punkty danych (czas i data) w celu określenia okresów prognozowania\nzobacz numer # 462: czas słoneczny i księżycowy bez części daty (tylko czas)\nDodaj bundesland / state jako opcję wyszukiwania i przenieś debug do dzienników informacji",
        "uk": "переклади символів\nдля визначення прогнозних періодів\nпереглянути номер #462: сонце і місяць тепер без дати частини (разово)\nДодайте бундесланд / стан, як варіант пошуку і перемістіть дебюг на інформаційні колоди",
        "zh-cn": "符号描述翻译\n确定预测期的新数据点(时间和日期)\n参见第462期:现在没有日期部分的日月时间(只限时)\n添加 buddesland / 状态为搜索选项, 并移动一些调试到信息日志"
      },
      "4.1.0": {
        "en": "see issue #457: forecast download for daily and hourly can now be disabled to reduce number of DP's\nsee issue #456: combination of postcode and free text search for location API added, if location not found by postcode a free text search is executed\nsee issue #458: unit for pressure changed to millibar / hPa\nsee issue #459: bug fix to be able to edit custom path for moon symbols\nif API provides night specific symbol description, it will be shown now\ndatapoint descriptions changed",
        "de": "siehe Ausgabe #457: prognostizierte Downloads für Tag und Stunde können jetzt deaktiviert werden, um die Anzahl der DP's zu reduzieren\nsiehe Ausgabe #456: Kombination von Postcode und freier Textsuche nach Standort API hinzugefügt, wenn nicht durch Postleitzahl gefunden eine kostenlose Textsuche ausgeführt wird\nsiehe Ausgabe #458: Einheit für Druck in Millibar / hPa\nsiehe ausgabe #459: bugfix, um benutzerdefinierte pfad für mondsymbole bearbeiten zu können\nwenn API eine nachtsspezifische Symbolbeschreibung bietet, wird es jetzt angezeigt\ndatenpunktbeschreibungen geändert",
        "ru": "#457: прогнозируемая загрузка для ежедневной и ежечасной загрузки теперь может быть отключена для уменьшения числа DP\n#456: комбинация почтового кода и бесплатного текстового поиска для добавленного API местоположения, если местоположение, не найденное почтовым индексом, выполняется бесплатный текстовый поиск\nсм. выпуск #458: единица давления изменена на миллибар / hPa\n#459: исправление ошибок для редактирования пользовательского пути для символов луны\nесли API предоставит описание ночного символа, то оно будет показано\nизменились описания точек данных",
        "pt": "ver número 457: o download da previsão para cada dia e hora pode agora ser desativado para reduzir o número de DP's\nver problema #456: combinação de código postal e pesquisa de texto livre para localização API adicionado, se localização não encontrada pelo código postal uma pesquisa de texto livre é executada\nver número 458: unidade de pressão alterada para milibar / hPa\nver problema # 459: correção de erros para ser capaz de editar caminho personalizado para símbolos de lua\nse a API fornecer a descrição do símbolo específico da noite, será mostrado agora\ndescrições dos pontos de dados alteradas",
        "nl": "zie nummer #457. Voorspelling downloaden voor dagelijks en uurlijks kan nu worden uitgeschakeld om het aantal DP's te verminderen\nzie nummer #456: combinatie van postcode en vrije tekst zoeken naar locatie API toegevoegd, als locatie niet gevonden door postcode een vrije tekst zoeken wordt uitgevoerd\nzie nummer #458: eenheid voor druk gewijzigd in millibar / hPa\nzie probleem #459: bug fix te kunnen bewerken aangepaste pad voor maan symbolen\nals API geeft nacht specifieke symbool beschrijving, zal het nu worden getoond\ngegevenspuntenbeschrijvingen gewijzigd",
        "fr": "voir le numéro 457: les prévisions de téléchargement quotidien et horaire peuvent maintenant être désactivées pour réduire le nombre de DP\nvoir le numéro 456: combinaison de code postal et recherche de texte libre pour l'API de localisation ajoutée, si l'emplacement non trouvé par code postal une recherche de texte libre est effectuée\nvoir le numéro 458: unité de pression changée en millibar/hPa\nvoir problème #459: correction de bug pour être en mesure de modifier le chemin personnalisé pour les symboles de lune\nsi API fournit une description de symbole spécifique à la nuit, elle sera affichée maintenant\nchangement des descriptions des points de données",
        "it": "vedi numero #457: il download delle previsioni per ogni giorno e ora può ora essere disabilitato per ridurre il numero di DP\nvedi numero #456: combinazione di codice postale e ricerca di testo gratuita per la posizione API aggiunto, se la posizione non trovata da codice postale viene eseguita una ricerca di testo gratuita\nvedi numero #458: unità per pressione cambiata in millibar / hPa\nvedi numero #459: bug fix per essere in grado di modificare il percorso personalizzato per i simboli lunari\nse API fornisce la descrizione specifica del simbolo di notte, verrà mostrato ora\nle descrizioni dei datapoint cambiate",
        "es": "ver número #457: previsiones de descarga para diario y hora ahora puede ser deshabilitado para reducir el número de DP\nver número #456: combinación de código postal y búsqueda gratuita de texto para la ubicación API añadido, si la ubicación no se encuentra por código postal una búsqueda de texto libre se ejecuta\nver el número #458: unidad para la presión cambiado a millibar / hPa\nver número #459: corrección de errores para poder editar ruta personalizada para símbolos de luna\nsi API proporciona la descripción del símbolo específica de la noche, se mostrará ahora\ndescripciones de puntos de datos cambiadas",
        "pl": "zobacz numer # 457: prognoza pobierania dziennych i godzinowych może być teraz wyłączona w celu zmniejszenia liczby DP\nzobacz numer # 456: połączenie kodu pocztowego i wolnego wyszukiwania tekstowego dla lokalizacji API dodano, jeśli lokalizacja nie została znaleziona przez kod pocztowy, wykonuje się darmowe wyszukiwanie tekstowe\nzob. numer # 458: jednostka ciśnienia zmieniona na millibar / hPa\nsee issue # 459: bug fix to be abonent to edit customs path for moon symbols\njeśli API dostarcza opis symboli określonych w nocy, zostanie to pokazane teraz\nzmienione opisy punktów danych",
        "uk": "переглянути номер #457: завантаження прогнозу для щоденного та годинного використання тепер може бути вимкнено для зменшення кількості ДП\nпереглянути номер #456: комбінація поштових індексів та безкоштовний текстовий пошук для розміщення API додано, якщо розташування не знайдено поштових індексів, виконано безкоштовний пошук тексту\nпереглянути номер #458: блок для тиску змінений на мілібар / hPa\nпереглянути номер #459: виправлення помилок, щоб мати можливість редагувати користувацький шлях для знаків місяця\nякщо API забезпечує нічний специфічний символ, він буде показано зараз\nописи точок даних змінені",
        "zh-cn": "参见第457期:每日和小时的预测下载现在可以被禁用,以减少DP的数量\n参见第456期:如果邮电码未找到位置,则执行免费文本搜索\n参见第458期:压力单位改为毫巴/hPa\n参见第459期: 错误修正, 以编辑月球符号的自定义路径\n如果 API 提供夜间特定符号描述, 它现在将会显示\n数据点描述更改"
      },
      "4.0.0": {
        "en": "**Breaking Changes**\ninstances of older versions **must be deleted** and a new instance must be created\n* rework with typescript\n* support of new api from DasWetter.com\n* adapter type changed from \"scheduled\" to \"deamon\"",
        "de": "**Veränderungen* *\nbeispiele älterer versionen **muss gelöscht werden** und eine neue instanz muss erstellt werden\n* nacharbeiten mit schrift\n* Unterstützung neuer api von DasWetter.com\n* adaptertyp geändert von \"geplant\" zu \"deamon\"",
        "ru": "**Преодоление изменений* *\nэкземпляры старых версий **должны быть удалены** и должен быть создан новый экземпляр \n* переработка с помощью typescript\n* поддержка новых api от DasWetter.com\nтип адаптера изменился с «запланированного» на «диамон»",
        "pt": "*Quebrar as Alterações **\ninstâncias de versões mais antigas ** devem ser apagadas** e uma nova instância deve ser criada\n* retrabalho com digitação\n* suporte de novo api de DasWitter.com\n* tipo de adaptador mudado de \"agendado\" para \"demônio\"",
        "nl": "**Breaking Changes* *\ninstanties van oudere versies **moet verwijderd worden** en er moet een nieuwe instantie aangemaakt worden\n* rework met typescript\n* ondersteuning van nieuwe api van DasWetter.com\n* adapter type veranderd van \"gepland\" naar \"deamon\"",
        "fr": "** Changements importants* *\nles instances des anciennes versions ** doivent être supprimées** et une nouvelle instance doit être créée\n* retravailler avec dactylographie\n* soutien de nouveaux api de DasWetter.com\n* type d'adaptateur changé de \"programmé\" à \"diamon\"",
        "it": "* Cambiamenti di cambiamento* #\nistanze di versioni precedenti ** devono essere eliminate** e deve essere creato un nuovo caso\n* rielaborare con typescript\n* supporto di nuovi api da DasWetter.com\n* tipo adattatore cambiato da \"scheduled\" a \"deamon\"",
        "es": "**Breaking Changes* *\ninstancias de versiones anteriores ** debe ser eliminado** y debe crearse una nueva instancia\n* rework with typescript\n* soporte de nuevo api de DasWetter.com\n* tipo de adaptador cambiado de \"scheduled\" a \"deamon\"",
        "pl": "** Breaking Changes **\ninstancje starszych wersji ** muszą zostać usunięte* * i należy utworzyć nową instancję \n* rework z maszynopisem\n* wsparcie nowego api z DasWetter.com\n* typ adaptera zmieniony z \"zaplanowanego\" na \"deamon\"",
        "uk": "** Зміна маршрутів* Ім'я *\nекземпляри старших версій**** та нового екземпляра повинні бути створені\n* реконструкція з типом\n* підтримка нового api від DasWetter.com\n* тип адаптера змінено з \"розміщеного\" до \"деамону\"",
        "zh-cn": "** 突发变化* * 《大会正式记录,第五十八届会议,补编第5号》(A/C.6/61/Rev.1)\n旧版本** 必须删除** 必须创建新实例\n* 用打字符重写\n* 来自DasWetter.com的新阿皮的支持\n*适配器类型从\"预定\"改为\"deamon\""
      },
      "3.2.8": {
        "en": "see issue #444: avoid crash if no data received, show response status in debug log",
        "de": "siehe ausgabe #444: crash vermeiden, wenn keine daten empfangen wurden, antwortstatus anzeigen in debug log",
        "ru": "проблема no444: избегайте сбоев, если данные не получены, покажите статус ответа в журнале отладки",
        "pt": "ver problema # 444: evitar falha se nenhum dado recebido, mostrar o estado de resposta no log de depuração",
        "nl": "zie probleem #444: crash vermijden als er geen gegevens zijn ontvangen, responsstatus tonen in debuglog",
        "fr": "voir le numéro 444: éviter le crash si aucune donnée n'a été reçue, afficher l'état de la réponse dans le journal de débogage",
        "it": "vedi problema #444: evitare crash se non sono stati ricevuti dati, mostrare lo stato di risposta nel registro di debug",
        "es": "ver el número #444: evitar el accidente si no se reciben datos, mostrar el estado de respuesta en el registro de depuración",
        "pl": "zobacz numer # 444: unikaj awarii, jeśli nie otrzymano danych, pokaż status odpowiedzi w dzienniku debugowania",
        "uk": "переглянути номер #444: уникнути аварійних ситуацій, якщо не було отримано дані, показати статус відповіді в журналі debug",
        "zh-cn": "参见第444期: 如果没有收到数据, 请避免崩溃, 在调试日志中显示响应状态 "
      }
    },
    "titleLang": {
      "en": "DasWetter.com",
      "de": "DasWetter.com",
      "ru": "DasWetter.com",
      "pt": "DasWetter.com",
      "nl": "DasWetter.com",
      "fr": "DasWetter.com",
      "it": "DasWetter.com",
      "es": "DasWetter.com",
      "pl": "DasWetter.com",
      "zh-cn": "DasWetter.com",
      "uk": "DasWetter.com"
    },
    "desc": {
      "en": "reads weather forecast data from DasWetter.com. Different forecast models are available.",
      "de": "liest Wettervorhersagedaten von DasWetter.com. Es stehen verschiedene Prognosemodelle zur Verfügung.",
      "ru": "читает данные прогноза погоды от DasWetter.com. Доступны разные модели прогноза.",
      "pt": "lê dados de previsão meteorológica do DasWetter.com. Diferentes modelos de previsão estão disponíveis.",
      "nl": "leest weersvoorspellingsgegevens van DasWetter.com. Verschillende voorspellingsmodellen zijn beschikbaar.",
      "fr": "lit les données météorologiques de DasWetter.com. Différents modèles de prévision sont disponibles.",
      "it": "legge i dati delle previsioni del tempo da DasWetter.com. Sono disponibili diversi modelli di previsione.",
      "es": "lee los datos del pronóstico del tiempo de DasWetter.com. Existen diferentes modelos de pronóstico disponibles.",
      "pl": "czyta prognozy pogody z DasWetter.com. Dostępne są różne modele prognoz.",
      "zh-cn": "从DasWetter.com读取天气预报数据。",
      "uk": "читає дані прогнозу погоди з DasWetter.com. Доступні різні моделі прогнозу."
    },
    "platform": "Javascript/Node.js",
    "mode": "daemon",
    "icon": "daswettercom.png",
    "enabled": true,
    "messagebox": true,
    "extIcon": "https://raw.githubusercontent.com/rg-engineering/ioBroker.daswetter/master/admin/daswettercom.png",
    "keywords": [
      "weather",
      "forecast",
      "DasWetter"
    ],
    "readme": "https://github.com/rg-engineering/ioBroker.daswetter/blob/master/README.md",
    "loglevel": "info",
    "stopBeforeUpdate": true,
    "type": "weather",
    "tier": 3,
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.6.17"
      }
    ],
    "plugins": {
      "sentry": {
        "dsn": "https://43cffc00abc44320960f9b7c237a7fbb@o390433.ingest.sentry.io/5434782"
      }
    },
    "compact": true,
    "authors": [
      {
        "name": "René G.",
        "email": "info@rg-engineering.eu"
      }
    ],
    "connectionType": "cloud",
    "dataSource": "poll",
    "adminUI": {
      "config": "materialize"
    },
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<3.9.9",
            "newVersion>=4.0.0"
          ]
        },
        "title": {
          "en": "new API of DasWetter is now supported",
          "de": "Die neue API von DasWetter wird nun unterstützt",
          "ru": "теперь поддерживается новый API DasWetter",
          "pt": "nova API do DasWetter agora é suportada",
          "nl": "nieuwe API van DasWetter wordt nu ondersteund",
          "fr": "la nouvelle API de DasWetter est désormais prise en charge",
          "it": "la nuova API di DasWetter è ora supportata",
          "es": "La nueva API de DasWetter ahora es compatible",
          "pl": "obsługiwane jest teraz nowe API DasWetter",
          "uk": "тепер підтримується новий API DasWetter",
          "zh-cn": "现在支持 DasWetter 的新 API"
        },
        "text": {
          "en": "The new DasWetter API is now supported. Users need to create an API key on the website. Additionally, the old DasWetter instance in ioBroker must be deleted and a new one created.",
          "de": "Ab sofort wird die neue API von DasWetter unterstützt. User müssen sich einen einen API key auf der website erstellen. Außerdem muss die alte Instanz von DasWetter hier in ioBroker gelöscht werden und eine neue angelegt werden.",
          "ru": "Теперь поддерживается новый API DasWetter. Пользователям необходимо создать ключ API на веб-сайте. Кроме того, необходимо удалить старый экземпляр DasWetter в ioBroker и создать новый.",
          "pt": "A nova API DasWetter agora é suportada. Os usuários precisam criar uma chave API no site. Além disso, a instância antiga do DasWetter no ioBroker deve ser excluída e uma nova criada.",
          "nl": "De nieuwe DasWetter API wordt nu ondersteund. Gebruikers moeten een API-sleutel op de website aanmaken. Bovendien moet de oude DasWetter-instantie in ioBroker worden verwijderd en moet er een nieuwe worden gemaakt.",
          "fr": "La nouvelle API DasWetter est désormais prise en charge. Les utilisateurs doivent créer une clé API sur le site Web. De plus, l'ancienne instance DasWetter dans ioBroker doit être supprimée et une nouvelle créée.",
          "it": "La nuova API DasWetter è ora supportata. Gli utenti devono creare una chiave API sul sito web. Inoltre, la vecchia istanza di DasWetter in ioBroker deve essere eliminata e crearne una nuova.",
          "es": "La nueva API DasWetter ahora es compatible. Los usuarios deben crear una clave API en el sitio web. Además, se debe eliminar la antigua instancia de DasWetter en ioBroker y crear una nueva.",
          "pl": "Obsługiwane jest teraz nowe API DasWetter. Użytkownicy muszą utworzyć klucz API na stronie internetowej. Dodatkowo należy usunąć starą instancję DasWetter w ioBroker i utworzyć nową.",
          "uk": "Тепер підтримується новий API DasWetter. Користувачам необхідно створити ключ API на веб-сайті. Крім того, старий екземпляр DasWetter в ioBroker потрібно видалити та створити новий.",
          "zh-cn": "现在支持新的 DasWetter API。用户需要在网站上创建API密钥。此外，必须删除 ioBroker 中的旧 DasWetter 实例并创建一个新实例。"
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {
    "ApiKey": "",
    "locations": [
      {
        "IsActive": true,
        "postcode": "",
        "city": "",
        "bundesland": "",
        "useDailyForecast": "true",
        "useHourlyForecast": "true"
      }
    ],
    "parseTimeout": 10,
    "parseInterval": 120,
    "IconSet": 1,
    "IconType": 1,
    "PNGSize": 2,
    "CustomPath": "",
    "WindIconSet": 1,
    "WindIconType": 1,
    "WindPNGSize": 2,
    "WindCustomPath": "",
    "MoonIconSet": 1,
    "MoonIconType": 1,
    "MoonPNGSize": 2,
    "MoonCustomPath": "",
    "CopyCurrentHour": false
  },
  "objects": [],
  "instanceObjects": [],
  "protectedNative": [],
  "encryptedNative": []
}
